In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({
                'a':[1,2,3,4],
                'b':[5,6,7,5],
                'c':['w','x','y','z']
                })
df

   a  b  c
0  1  5  w
1  2  6  x
2  3  7  y
3  4  5  z

## Csv File

In [14]:
df.to_csv('~/Documents/sample.csv',index=False)            ##writing to csv file

In [15]:
pd.read_csv('~/Documents/sample.csv')                  ##reading csv file

   a  b  c
0  1  5  w
1  2  6  x
2  3  7  y
3  4  5  z

## Excel File

In [7]:
df.to_excel('~/Documents/sample.xlsx',sheet_name='new sheet',index=False)

In [8]:
pd.read_excel('~/Documents/sample.xlsx')

   a  b  c
0  1  5  w
1  2  6  x
2  3  7  y
3  4  5  z

## HTML

In [12]:
data = pd.read_html('https://www.espn.com/nhl/stats?season=2015&seasontype=2')
data

[              Points               PTS
 0     1Jamie BennDAL                87
 1   2John TavaresNYI                86
 2  3Sidney CrosbyPIT                84
 3  4Alex OvechkinWSH                81
 4  4Jakub VoracekPHI                81
 5   Complete Leaders  Complete Leaders,
                Goals                 G
 0  1Alex OvechkinWSH                53
 1  2Steven StamkosTB                43
 2      3Rick NashNYR                42
 3   4John TavaresNYI                38
 4   5Tyler SeguinDAL                37
 5   Complete Leaders  Complete Leaders,
            Plus/Minus               +/-
 0  1Max PaciorettyMTL                38
 1  1Nikita KucherovTB                38
 2    3Tyler JohnsonTB                33
 3     4Ondrej PalatTB                31
 4  5Jonathan ToewsCHI                30
 5    Complete Leaders  Complete Leaders,
       Goals Against Avg               GAA
 0       1Carey PriceMTL              1.96
 1  2Devan DubnykARI/MIN              2.07
 2       3Pekka RinneNSH              2.18
 3        4Cam TalbotNYR              2.21
 4     5Braden HoltbyWSH              2.22
 5      Complete Leaders  Complete Leaders,
         Save Percentage             SVPCT
 0       1Carey PriceMTL              .933
 1  2Devan DubnykARI/MIN              .929
 2       3Steve MasonPHI              .928
 3        4Cam TalbotNYR              .926
 4     5Cory SchneiderNJ              .925
 5      Complete Leaders  Complete Leaders,
                  Wins                 W
 0     1Carey PriceMTL                44
 1     2Pekka RinneNSH                41
 2   2Braden HoltbyWSH                41
 3       4Ben BishopTB                40
 4  5Jaroslav HalakNYI                38
 5    Complete Leaders  Complete Leaders,
       Skating
 0      Points
 1       Goals
 2  Plus/Minus,
              Goaltending
 0  Goals Against Average
 1        Save Percentage
 2                   Wins,
            Skating
 0   Goals Per Game
 1     Power Play %
 2  Penalty Minutes,
              Goaltending
 0  Goals Against Average
 1        Save Percentage
 2               Shutouts]

In [14]:
data[0].head()

              Points PTS
0     1Jamie BennDAL  87
1   2John TavaresNYI  86
2  3Sidney CrosbyPIT  84
3  4Alex OvechkinWSH  81
4  4Jakub VoracekPHI  81

## SQL

In [15]:
from sqlalchemy import create_engine
engine= create_engine('sqlite:///:memory')

In [20]:
df.to_sql('sample_index', engine, index=False)

In [21]:
sql_df = pd.read_sql('my_table', con=engine)
sql_df

   index  a  b  c
0      0  1  5  w
1      1  2  6  x
2      2  3  7  y
3      3  4  5  z